Revit 2027 API
ParameterUtils.DownloadParameterOptions(ForgeTypeId, String) Method
 Retrieves settings associated with the given parameter from the Parameters Service.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ParameterDownloadOptions DownloadParameterOptions(
	ForgeTypeId parameterTypeId,
	string region
)
Public Shared Function DownloadParameterOptions (
	parameterTypeId As ForgeTypeId,
	region As String
) As ParameterDownloadOptions
public:
static ParameterDownloadOptions^ DownloadParameterOptions(
	ForgeTypeId^ parameterTypeId,
	String^ region
)
static member DownloadParameterOptions :
        parameterTypeId : ForgeTypeId *
        region : string -> ParameterDownloadOptions
Parameters
parameterTypeId ForgeTypeId
 Parameter identifier.
region String
 Region of the account where the parameter is defined.
Return Value
ParameterDownloadOptions
 Settings associated with a parameter.
Exceptions
Exception | Condition
AccessDeniedException |  Thrown when the user is not authorized to access the requested information.
ArgumentException |  The region is not valid. -or- Thrown when the given parameter identifier is empty.
ArgumentNullException |  A non-optional argument was null
[!:Autodesk::Revit::Exceptions::NetworkCommunicationError] |  Thrown when communication with the Parameters Service is unsuccessful.
ResourceNotFoundException |  Thrown when the requested parameter is not found.
ServerInternalException |  Thrown when the Parameters Service reports an internal error.
UnauthenticatedException |  Thrown when the user is not signed in.
Remarks
 The settings associated with a parameter definition are accessible only to an authorized user. To retrieve them, the user must be signed in.
See Also
Reference
ParameterUtils Class
DownloadParameterOptions Overload
Autodesk.Revit.DB Namespace